Dataset/Swarm/29-07-24/15/socialNetwork/2/swarm-sn-wrk-mixed-c6525-25g-exp15-havail1-hori1-verti1-infi1-client1-t8-c512-d30-R2000-N2
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=2000
Running 30s test @ http://localhost:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 500.314ms, rate sampling interval: 3848ms
  Thread calibration: mean lat.: 468.687ms, rate sampling interval: 3459ms
  Thread calibration: mean lat.: 620.422ms, rate sampling interval: 4399ms
  Thread calibration: mean lat.: 666.278ms, rate sampling interval: 4341ms
  Thread calibration: mean lat.: 464.990ms, rate sampling interval: 3397ms
  Thread calibration: mean lat.: 534.551ms, rate sampling interval: 4038ms
  Thread calibration: mean lat.: 530.492ms, rate sampling interval: 3893ms
  Thread calibration: mean lat.: 446.920ms, rate sampling interval: 3325ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.42s     4.07s   18.79s    84.91%
    Req/Sec   157.66     17.32   222.00     73.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.88s 
 75.000%    5.42s 
 90.000%    8.63s 
 99.000%   18.79s 
 99.900%   20.37s 
 99.990%   20.86s 
 99.999%   21.09s 
100.000%   21.09s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.633     0.000000            1         1.00
      56.927     0.100000         2536         1.11
     155.775     0.200000         5072         1.25
     445.695     0.300000         7609         1.43
    1026.047     0.400000        10144         1.67
    1879.039     0.500000        12680         2.00
    2392.063     0.550000        13955         2.22
    2936.831     0.600000        15216         2.50
    3622.911     0.650000        16485         2.86
    4489.215     0.700000        17758         3.33
    5419.007     0.750000        19022         4.00
    5894.143     0.775000        19656         4.44
    6443.007     0.800000        20290         5.00
    6971.391     0.825000        20922         5.71
    7512.063     0.850000        21558         6.67
    7999.487     0.875000        22191         8.00
    8265.727     0.887500        22508         8.89
    8626.175     0.900000        22825        10.00
    9134.079     0.912500        23141        11.43
    9715.711     0.925000        23458        13.33
   10313.727     0.937500        23775        16.00
   10649.599     0.943750        23934        17.78
   11042.815     0.950000        24093        20.00
   11788.287     0.956250        24249        22.86
   12771.327     0.962500        24408        26.67
   14032.895     0.968750        24566        32.00
   14852.095     0.971875        24645        35.56
   15720.447     0.975000        24725        40.00
   16580.607     0.978125        24805        45.71
   17301.503     0.981250        24883        53.33
   17940.479     0.984375        24964        64.00
   18202.623     0.985938        25003        71.11
   18431.999     0.987500        25045        80.00
   18694.143     0.989062        25085        91.43
   18890.751     0.990625        25124       106.67
   19038.207     0.992188        25163       128.00
   19136.511     0.992969        25181       142.22
   19218.431     0.993750        25200       160.00
   19316.735     0.994531        25220       182.86
   19447.807     0.995313        25240       213.33
   19595.263     0.996094        25260       256.00
   19693.567     0.996484        25269       284.44
   19791.871     0.996875        25283       320.00
   19841.023     0.997266        25289       365.71
   19972.095     0.997656        25299       426.67
   20037.631     0.998047        25309       512.00
   20152.319     0.998242        25314       568.89
   20217.855     0.998437        25319       640.00
   20250.623     0.998633        25324       731.43
   20332.543     0.998828        25332       853.33
   20381.695     0.999023        25334      1024.00
   20430.847     0.999121        25336      1137.78
   20463.615     0.999219        25340      1280.00
   20496.383     0.999316        25342      1462.86
   20529.151     0.999414        25345      1706.67
   20545.535     0.999512        25346      2048.00
   20561.919     0.999561        25347      2275.56
   20627.455     0.999609        25349      2560.00
   20660.223     0.999658        25350      2925.71
   20692.991     0.999707        25351      3413.33
   20725.759     0.999756        25352      4096.00
   20824.063     0.999780        25353      4551.11
   20856.831     0.999805        25355      5120.00
   20856.831     0.999829        25355      5851.43
   20856.831     0.999854        25355      6826.67
   20856.831     0.999878        25355      8192.00
   21004.287     0.999890        25357      9102.22
   21004.287     0.999902        25357     10240.00
   21004.287     0.999915        25357     11702.86
   21004.287     0.999927        25357     13653.33
   21004.287     0.999939        25357     16384.00
   21004.287     0.999945        25357     18204.44
   21004.287     0.999951        25357     20480.00
   21004.287     0.999957        25357     23405.71
   21086.207     0.999963        25358     27306.67
   21086.207     1.000000        25358          inf
#[Mean    =     3417.944, StdDeviation   =     4068.643]
#[Max     =    21069.824, Total count    =        25358]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  39537 requests in 30.06s, 369.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
  Non-2xx or 3xx responses: 512
Requests/sec:   1315.13
Transfer/sec:     12.28MB